Repository: NghiaLio/Zipo-App
Catalog: lib/l10n/app_*.arb
Languages: vi

source: Hello
vi: Xin chào

source: Monday
vi: Thứ hai

# fill_info
source: Please fill in all information
vi: Vui lòng nhập đầy đủ thông tin

source: HELLO, SIGN IN
vi: XIN CHÀO, ĐĂNG NHẬP

# email_hint
source: Email address (e.g. joydeo@gmail.com)
vi: Địa chỉ email (ví dụ: joydeo@gmail.com)

source: Password
vi: Mật khẩu

source: Forgot password?
vi: Quên mật khẩu?

# signin_button
source: SIGN IN
vi: ĐĂNG NHẬP

# dont_have_account
source: Don't have an account?
vi: Chưa có tài khoản?

# signup_link
source: Sign up
vi: Đăng ký

# enter_email
source: Please enter your email
vi: Vui lòng nhập email

# email_not_correct
source: Invalid email format
vi: Email không đúng định dạng

# enter_name
source: Please enter your name
vi: Vui lòng nhập tên

# name_too_short
source: Name must be at least 4 characters
vi: Tên phải ít nhất 4 ký tự

# enter_password
source: Please enter your password
vi: Vui lòng nhập mật khẩu

# password_too_short
source: Password must be at least 6 characters
vi: Mật khẩu phải ít nhất 6 ký tự

# enter_confirm_password
source: Please enter confirm password
vi: Vui lòng nhập lại mật khẩu

# confirm_password_not_match
source: Passwords do not match
vi: Mật khẩu không trùng khớp

# create_account_title
source: CREATE ACCOUNT
vi: TẠO TÀI KHOẢN

source: Full Name
vi: Họ và tên

source: Phone or Email
vi: Số điện thoại hoặc Email

source: Confirm Password
vi: Xác nhận mật khẩu

# signup_button
source: SIGN UP
vi: ĐĂNG KÝ

# already_have_account
source: Already have an account?
vi: Đã có tài khoản?

# signin_link
source: Sign in
vi: Đăng nhập

# enter_your_email
source: Please enter your email
vi: Vui lòng nhập email của bạn

source: Incorrect email
vi: Email không chính xác

# reset_password_title
source: Reset Password
vi: Đặt lại mật khẩu

# enter_email_to_reset
source: Enter your email to reset
vi: Nhập email của bạn để đặt lại

source: Email Address
vi: Địa chỉ Email

# reset_instructions
source: We will send a password reset link to your email address.
vi: Chúng tôi sẽ gửi một liên kết đặt lại mật khẩu đến địa chỉ email của bạn.

source: Send Reset Link
vi: Gửi liên kết đặt lại

source: Back to Login
vi: Quay lại Đăng nhập

source: Email Sent!
vi: Đã gửi Email!

# email_sent_details
source: A password reset link has been sent to your email address. Please check your inbox.
vi: Một liên kết đặt lại mật khẩu đã được gửi đến địa chỉ email của bạn. Vui lòng kiểm tra hộp thư đến.

source: Got it
vi: Đã hiểu

# home_screen_title
source: Home Screen
vi: Màn hình chính

# logout_button
source: Logout
vi: Đăng xuất

# messages_tab
source: Messages
vi: Tin nhắn

# posts_tab
source: Posts
vi: Bài viết

# profile_tab
source: Profile
vi: Cá nhân

# messages_title
source: Messages
vi: Tin nhắn

# user_not_found
source: User info not found
vi: Không tìm thấy thông tin người dùng

# friend_list_load_error
source: Could not load friend list
vi: Không thể tải danh sách bạn bè

# no_friends
source: No friends yet
vi: Chưa có bạn bè nào

# delete_message_success
source: Message deleted successfully
vi: Xóa tin nhắn thành công

# messages_load_error
source: Could not load messages
vi: Không thể tải tin nhắn

# no_messages
source: No messages yet
vi: Chưa có tin nhắn nào

# loading_error
source: Error loading data
vi: Lỗi khi tải dữ liệu

# search_hint
source: Search...
vi: Tìm kiếm...

# notifications_action
source: Notifications
vi: Thông báo

# delete_action
source: Delete
vi: Xóa

source: Unknown User
vi: Người dùng không xác định

# start_conversation_hint
source: Start a conversation!
vi: Hãy bắt đầu cuộc trò chuyện!

# post_created_success
source: Post created successfully!
vi: Bài viết đã được tạo thành công!

# post_created_failed
source: Post creation failed!
vi: Bài viết tạo thất bại!

source: Posting in progress...
vi: Đang đăng bài viết...

# posts_title
source: Posts
vi: Bài viết

# post_load_error
source: Error loading posts: {error}
vi: Lỗi tải bài viết: {error}

# no_posts_message
source: No posts yet. Let's create a new post!
vi: Chưa có bài viết nào. Hãy tạo bài viết mới!

# post_deleted_success
source: Post deleted
vi: Bài viết đã được xóa

# image_pick_error
source: Error picking image
vi: Lỗi khi chọn ảnh

# video_pick_error
source: Error picking video
vi: Lỗi khi chọn video

# content_empty_error
source: Please enter post content
vi: Vui lòng nhập nội dung bài viết

# post_updated_success
source: Post updated successfully!
vi: Bài viết đã được cập nhật!

# post_update_error
source: Error updating post
vi: Lỗi khi cập nhật bài viết

# post_create_error
source: Error creating post
vi: Lỗi khi tạo bài viết

# edit_post_title
source: Edit post
vi: Chỉnh sửa bài viết

# create_post_title
source: Create post
vi: Tạo bài viết

# save_button
source: Save
vi: Lưu

# post_button
source: Post
vi: Đăng

# public_visibility
source: Public
vi: Công khai

# what_on_your_mind
source: What's on your mind?
vi: Bạn đang nghĩ gì?

source: Add to post
vi: Thêm vào bài viết

# edit_post_action
source: Edit Post
vi: Chỉnh sửa bài viết

# delete_post_action
source: Delete Post
vi: Xóa bài viết

# cancel_action
source: Cancel
vi: Hủy

# delete_confirm_title
source: Confirm Delete
vi: Xác nhận xóa

# delete_confirm_message
source: Are you sure you want to delete this post?
vi: Bạn có chắc chắn muốn xóa bài viết này không?

# delete_button
source: Delete
vi: Xóa

# empty_comment_error
source: You cannot post an empty comment
vi: Bạn không thể gửi bình luận trống

# media_upload_failed
source: Media upload failed. Please try again.
vi: Tải lên media thất bại. Vui lòng thử lại.

# pick_image_action
source: Pick image
vi: Chọn ảnh

# pick_video_action
source: Pick video
vi: Chọn video

# image_pick_failed
source: Cannot pick image. Please try again.
vi: Không thể chọn ảnh. Vui lòng thử lại.

# video_pick_failed
source: Cannot pick video. Please try again.
vi: Không thể chọn video. Vui lòng thử lại.

# comment_empty_save_error
source: Comment cannot be empty
vi: Bình luận không thể để trống

# delete_comment_title
source: Delete Comment
vi: Xóa bình luận

# delete_comment_confirm
source: Are you sure you want to delete this comment?
vi: Bạn có chắc chắn muốn xóa bình luận này?

# edit_comment_action
source: Edit comment
vi: Sửa bình luận

# comments_header
source: Comments ({count})
vi: Bình luận ({count})

# no_comments_message
source: No comments yet. Be the first to comment!
vi: Chưa có bình luận nào. Hãy là người đầu tiên bình luận!

# replying_to
source: Replying to {name}
vi: Đang phản hồi {name}

# write_comment_hint
source: Write a comment...
vi: Viết bình luận...

# post_author_label
source: Author
vi: Tác giả

# add_media_placeholder
source: Add photo/video
vi: Thêm ảnh/video

# reply_action
source: Reply
vi: Phản hồi

# comment_hint_edit
source: Comment content ...
vi: Nội dung bình luận ...

# comment_load_error
source: Could not load comments.
vi: Không thể tải bình luận.

# retry_button
source: Retry
vi: Thử lại

source: User info not found
vi: Không tìm thấy thông tin người dùng

# reload_button
source: Reload
vi: Tải lại

# posts_stat
source: Posts
vi: Bài viết

# friends_stat
source: Friends
vi: Bạn bè

# personal_info_menu
source: Personal Info
vi: Thông tin cá nhân

# friends_menu
source: Friends
vi: Bạn bè

# notifications_menu
source: Notifications
vi: Thông báo

# about_menu
source: About
vi: Giới thiệu

# logout_menu
source: Logout
vi: Đăng xuất

# image_selected_success
source: Image selected
vi: Ảnh đã được chọn

# image_pick_error_detail
source: Error picking image: {error}
vi: Lỗi khi chọn ảnh: {error}

# name_empty_error
source: Name cannot be empty
vi: Tên không được để trống

# profile_update_error_detail
source: Error uploading image: {error}
vi: Lỗi khi tải ảnh lên: {error}

# info_saved_success
source: Info saved
vi: Đã lưu thông tin

# cancel_edit_title
source: Discard changes?
vi: Hủy chỉnh sửa?

# cancel_edit_message
source: Changes will not be saved
vi: Các thay đổi sẽ không được lưu

# stay_button
source: Stay
vi: Ở lại

# confirm_cancel_button
source: Discard
vi: Hủy

# personal_info_title
source: Personal Info
vi: Thông tin cá nhân

# display_name_label
source: Display Name
vi: Tên hiển thị

# other_name_label
source: Other Name
vi: Tên khác

# phone_number_label
source: Phone Number
vi: Số điện thoại

# address_label
source: Address
vi: Địa chỉ

# other_info_section
source: Other Info
vi: Thông tin khác

# save_changes_button
source: Save Changes
vi: Lưu thay đổi

# enter_field_hint
source: Enter {field}
vi: Nhập {field}

# friend_requests_tab_title
source: Friend Requests
vi: Lời mời kết bạn

# friends_tab_title
source: Friends
vi: Bạn bè

# search_hint_dots
source: Search...
vi: Tìm kiếm...

# no_results
source: No results found
vi: Không tìm thấy kết quả

# remove_friend_title
source: Remove friend
vi: Xóa bạn bè

# remove_friend_confirm
source: Are you sure you want to remove {name} from your friend list?
vi: Bạn có chắc muốn xóa {name} khỏi danh sách bạn bè?

# remove_friend_success
source: Removed {name} from friend list
vi: Đã xóa {name} khỏi danh sách bạn bè

# unfriend_action
source: Unfriend
vi: Xóa bạn bè

# no_friend_requests
source: No friend requests yet
vi: Chưa có lời mời kết bạn nào

# accept_button
source: Confirm
vi: Xác nhận

# reject_button
source: Delete
vi: Từ chối

# app_version
source: Version 1.0.0
vi: Phiên bản 1.0.0

# about_app_section
source: About App
vi: Về ứng dụng

# about_app_description
source: Zipo Social is a modern messaging app designed to connect people easily and securely. With a friendly interface and rich features, the app provides a great chat experience for users.
vi: Zipo Social là một ứng dụng nhắn tin hiện đại được thiết kế để kết nối mọi người một cách dễ dàng và bảo mật. Với giao diện thân thiện và tính năng phong phú, ứng dụng mang đến trải nghiệm trò chuyện tuyệt vời cho người dùng.

# key_features_section
source: Key Features
vi: Tính năng chính

# messaging_feature_title
source: Real-time Messaging
vi: Nhắn tin thời gian thực

# messaging_feature_desc
source: Send and receive instant messages with friends
vi: Gửi và nhận tin nhắn tức thì với bạn bè

# media_sharing_title
source: Media Sharing
vi: Chia sẻ hình ảnh & video

# media_sharing_desc
source: Share moments in high quality
vi: Chia sẻ khoảnh khắc với chất lượng cao

# friend_management_title
source: Friend Management
vi: Quản lý bạn bè

# friend_management_desc
source: Connect and manage friend lists easily
vi: Kết nối và quản lý danh sách bạn bè dễ dàng

# smart_notifications_title
source: Smart Notifications
vi: Thông báo thông minh

# smart_notifications_desc
source: Get important notifications on time
vi: Nhận thông báo quan trọng kịp thời

# high_security_title
source: High Security
vi: Bảo mật cao

# high_security_desc
source: Data is encrypted and safely protected
vi: Dữ liệu được mã hóa và bảo vệ an toàn

# about_us_section
source: About Us
vi: Về chúng tôi

# about_us_description
source: Zipo Social is developed by a one-member team for the purpose of practicing, improving and developing Flutter programming skills.
vi: Zipo Social được phát triển bởi đội ngũ một thành viên với mục đích thực hành, nâng cao và phát triển kỹ năng lập trình Flutter.

# contact_us_label
source: Contact us:
vi: Liên hệ với chúng tôi:

# copyright_text
source: © 2024 Maintain Chat App. All rights reserved.
vi: © 2024 Maintain Chat App. Tất cả quyền được bảo lưu.

# settings_title
source: Settings
vi: Cài đặt

# interface_section
source: Interface
vi: Giao diện

# storage_management_menu
source: Storage Management
vi: Quản lý bộ nhớ

# storage_management_subtitle
source: View and free up space
vi: Xem và giải phóng dung lượng

# security_menu
source: Security
vi: Bảo mật

# security_subtitle
source: Password
vi: Mật khẩu

# help_menu
source: Help
vi: Trợ giúp

# help_subtitle
source: FAQ, contact support
vi: Câu hỏi thường gặp, liên hệ hỗ trợ

# other_section
source: Other
vi: Khác

# language_menu
source: Language
vi: Ngôn ngữ

# select_language_title
source: Select Language
vi: Chọn ngôn ngữ

# light_theme
source: Light
vi: Sáng

# dark_theme
source: Dark
vi: Tối

# system_theme
source: System
vi: Tự động

# select_theme_title
source: Select Theme
vi: Chọn giao diện

# light_theme_desc
source: Light theme
vi: Giao diện sáng

# dark_theme_desc
source: Dark theme
vi: Giao diện tối

# system_theme_desc
source: Follow system settings
vi: Theo cài đặt hệ thống

# font_size_menu
source: Font Size
vi: Cỡ chữ

# select_font_size_title
source: Select Font Size
vi: Chọn cỡ chữ

# sample_message
source: Hello! This is a sample message
vi: Xin chào! Đây là tin nhắn mẫu

# chat_wallpaper_menu
source: Chat Wallpaper
vi: Hình nền chat

# default_wallpaper
source: Default
vi: Mặc định

# green_wallpaper
source: Green
vi: Xanh lá

# pink_wallpaper
source: Pink
vi: Hồng

# orange_wallpaper
source: Orange
vi: Cam

# select_wallpaper_title
source: Select Wallpaper
vi: Chọn hình nền

# cache_memory
source: Cache
vi: Bộ nhớ đệm

# optimize_performance
source: Optimize app performance
vi: Tối ưu hiệu suất ứng dụng

# cache_description
source: Cache helps the app load faster by temporarily storing images, videos and other data. Clearing cache will free up storage space but may slow down the app during initial use.
vi: Bộ nhớ đệm giúp ứng dụng tải nhanh hơn bằng cách lưu trữ tạm thời hình ảnh, video và dữ liệu khác. Việc xóa bộ nhớ đệm sẽ giải phóng không gian lưu trữ nhưng có thể làm chậm ứng dụng trong lần sử dụng đầu tiên.

# clear_cache_button
source: Clear Cache
vi: Giải phóng bộ nhớ đệm

# notice_label
source: Note
vi: Lưu ý

# downloaded_media_notice
source: Downloaded images and videos will not be deleted
vi: Hình ảnh và video đã tải xuống sẽ không bị xóa

# cache_recreation_notice
source: Cache data will be recreated when you use the app
vi: Dữ liệu đệm sẽ được tạo lại khi bạn sử dụng ứng dụng

# speed_notice
source: The app may run slower after clearing cache
vi: Ứng dụng có thể chạy chậm hơn sau khi xóa đệm

# clear_cache_confirm_title
source: Confirm
vi: Xác nhận

# clear_cache_confirm_message
source: Are you sure you want to clear cache? This will delete all temporary data.
vi: Bạn có chắc chắn muốn giải phóng bộ nhớ đệm? Thao tác này sẽ xóa tất cả dữ liệu tạm thời.

# clear_cache_success
source: Cleared cache successfully
vi: Đã giải phóng bộ nhớ đệm thành công

# reset_password_menu
source: Reset Password
vi: Đặt lại mật khẩu

# protect_account_subtitle
source: Protect your account
vi: Bảo vệ tài khoản của bạn

# security_description
source: To ensure your account safety, we recommend changing your password periodically. A strong password should have at least 8 characters, including uppercase, lowercase, numbers and special characters.
vi: Để đảm bảo an toàn cho tài khoản của bạn, chúng tôi khuyến nghị thay đổi mật khẩu định kỳ. Mật khẩu mạnh nên có ít nhất 8 ký tự, bao gồm chữ hoa, chữ thường, số và ký tự đặc biệt.

# enter_email_hint
source: Enter your email
vi: Nhập email của bạn

# send_button
source: Send
vi: Gửi

# security_tips_title
source: Security Tips
vi: Mẹo bảo mật

# strong_password_tip
source: Use a strong and unique password
vi: Sử dụng mật khẩu mạnh và độc nhất

# periodic_change_tip
source: Change password periodically (every 3-6 months)
vi: Thay đổi mật khẩu định kỳ (3-6 tháng/lần)

# no_share_password_tip
source: Do not share password with others
vi: Không chia sẻ mật khẩu với người khác

# two_factor_auth_tip
source: Enable 2-step authentication for enhanced security
vi: Bật xác thực 2 bước để tăng cường bảo mật

# invalid_email_error
source: Invalid email
vi: Email không hợp lệ

# reset_email_sent_success
source: Reset password email sent. Please check your inbox.
vi: Đã gửi email đặt lại mật khẩu. Vui lòng kiểm tra hộp thư của bạn.

# help_support_title
source: We're here to help
vi: Chúng tôi sẵn sàng hỗ trợ

# help_support_subtitle
source: Find answers and contact support
vi: Tìm câu trả lời và liên hệ hỗ trợ

# faq_section
source: Frequently Asked Questions
vi: Câu hỏi thường gặp

# faq_how_to_send_msg_q
source: How to send a message?
vi: Làm thế nào để gửi tin nhắn?

# faq_how_to_send_msg_a
source: Select a contact from the list or search, then enter the message in the chat box and press send.
vi: Chọn người liên hệ từ danh sách hoặc tìm kiếm, sau đó nhập tin nhắn ở ô chat và nhấn gửi.

# faq_how_to_delete_msg_q
source: How to delete a message?
vi: Làm thế nào để xóa tin nhắn?

# faq_how_to_delete_msg_a
source: Press and hold the message you want to delete, then select "Delete" from the menu. You can delete for yourself or for everyone.
vi: Nhấn giữ vào tin nhắn bạn muốn xóa, sau đó chọn "Xóa" từ menu hiện lên. Bạn có thể xóa cho mình hoặc cho tất cả mọi người.

# faq_how_to_change_avatar_q
source: How to change profile picture?
vi: Làm thế nào để thay đổi ảnh đại diện?

# faq_how_to_change_avatar_a
source: Go to Profile, tap on the current profile picture, then select "Change photo" to upload a new one from your gallery or take a photo.
vi: Vào phần Hồ sơ, chạm vào ảnh đại diện hiện tại, sau đó chọn "Thay đổi ảnh" để tải ảnh mới từ thư viện hoặc chụp ảnh.

# faq_how_to_disable_notif_q
source: How to turn off notifications?
vi: Làm thế nào để tắt thông báo?

# faq_how_to_disable_notif_a
source: Go to Settings > Notifications, then turn off the notification options you don't want to receive.
vi: Vào Cài đặt > Thông báo, sau đó tắt các tùy chọn thông báo bạn không muốn nhận.

# contact_support_section
source: Contact Support
vi: Liên hệ hỗ trợ

# contact_email_desc
source: Send us an email
vi: Gửi email cho chúng tôi

# contact_hotline_desc
source: Call for support (8:00 - 22:00)
vi: Gọi điện hỗ trợ (8:00 - 22:00)

# contact_livechat_label
source: Live Chat
vi: Trò chuyện trực tuyến

# contact_livechat_desc
source: Fast response within a few minutes
vi: Phản hồi nhanh trong vài phút

# contact_website_desc
source: Access help center
vi: Truy cập trung tâm trợ giúp

# average_response_time
source: Average response time: 2-4 business hours
vi: Thời gian phản hồi trung bình: 2-4 giờ làm việc

# no_data_message
source: No data
vi: Không có dữ liệu

# error_occurred
source: An error occurred
vi: Đã xảy ra lỗi

source: Send friend request failed
vi: Gửi lời mời kết bạn thất bại

# revoke_invitation
source: Revoke
vi: Thu hồi

# add_friend_action
source: Add friend
vi: Kết bạn

# loading_label
source: Loading...
vi: Đang tải...

source: Storage permission denied
vi: Quyền truy cập bộ nhớ bị từ chối

# download_success
source: Downloaded: {fileName}
vi: Đã tải xuống: {fileName}

# download_error
source: Error downloading: {error}
vi: Lỗi khi tải xuống: {error}

source: Cannot load video
vi: Không thể tải video

source: Just now
vi: Vừa xong

# me_label
source: Me
vi: Tôi

# image_tag
source: [Image]
vi: [Hình ảnh]

# send_image_failed
source: Send image failed: {error}
vi: Gửi ảnh thất bại: {error}

# send_video_failed
source: Send video failed: {error}
vi: Gửi video thất bại: {error}

# send_audio_failed
source: Send audio failed: {error}
vi: Gửi audio thất bại: {error}

source: Sending audio...
vi: Đang gửi audio...

source: Sending video...
vi: Đang gửi video...

source: Sending image...
vi: Đang gửi ảnh...

# pick_image_label
source: Pick image
vi: Chọn ảnh

# pick_video_label
source: Pick video
vi: Chọn video

# record_audio_label
source: Record audio
vi: Ghi âm

# active_now_label
source: Active now
vi: Đang hoạt động

# view_profile_label
source: View profile
vi: Xem trang cá nhân

source: Send message failed
vi: Gửi tin nhắn thất bại

source: Delete message failed
vi: Xoá tin nhắn thất bại

# load_messages_error
source: Error loading messages: {error}
vi: Lỗi tải tin nhắn: {error}

# start_chat_hint
source: Start a conversation with {name}!
vi: Bắt đầu cuộc trò chuyện với {name}!

# delete_message_action
source: Delete message
vi: Xóa tin nhắn

# delete_message_confirm_title
source: Confirm delete message
vi: Xác nhận xóa tin nhắn

# delete_message_confirm_message
source: Are you sure you want to delete this message?
vi: Bạn có chắc chắn muốn xóa tin nhắn này không?

# replying_label
source: Replying to {name}
vi: Đang trả lời {name}

# type_message_hint
source: Type a message...
vi: Nhập tin nhắn...

# auth_error_user_not_found
source: Account does not exist
vi: Tài khoản không tồn tại

# auth_error_wrong_password
source: Incorrect password
vi: Mật khẩu không đúng

# auth_error_invalid_email
source: Invalid email
vi: Email không hợp lệ

# auth_error_user_disabled
source: Account has been disabled
vi: Tài khoản đã bị vô hiệu hóa

# auth_error_too_many_requests
source: Too many requests. Please try again later
vi: Quá nhiều lần thử. Vui lòng thử lại sau

# auth_error_network_failed
source: Network connection error
vi: Lỗi kết nối mạng

# auth_error_invalid_credential
source: Email or password is incorrect
vi: Email hoặc mật khẩu không đúng

# auth_error_email_already_in_use
source: Email is already in use
vi: Email đã được sử dụng

# auth_error_weak_password
source: Weak password. Please choose a stronger one
vi: Mật khẩu quá yếu. Vui lòng chọn mật khẩu mạnh hơn

# auth_error_operation_not_allowed
source: Registration feature is disabled
vi: Tính năng đăng ký đã bị tắt

# auth_error_default
source: Operation failed
vi: Thao tác thất bại

# auth_login_failed
source: Login failed
vi: Đăng nhập thất bại

# auth_register_failed
source: Account creation failed
vi: Tạo tài khoản thất bại

# auth_check_failed
source: Error checking authentication
vi: Có lỗi khi kiểm tra xác thực

# auth_reset_failed
source: Reset password failed, try again later
vi: Đặt lại mật khẩu thất bại, thử lại sau

# me_label_chat
source: Me
vi: Tôi

source: Select image
vi: Chọn ảnh

source: Select video
vi: Chọn video

source: Record audio
vi: Ghi âm

# recording_status
source: Recording...
vi: Đang ghi âm...

# sending_audio_status
source: Sending audio...
vi: Đang gửi audio...

# sending_video_status
source: Sending video...
vi: Đang gửi video...

# sending_image_status
source: Sending image...
vi: Đang gửi ảnh...

# view_profile_menu
source: View profile
vi: Xem trang cá nhân

# send_image_failed_chat
source: Send image failed
vi: Gửi ảnh thất bại

# send_video_failed_chat
source: Send video failed
vi: Gửi video thất bại

# send_audio_failed_chat
source: Send audio failed
vi: Gửi audio thất bại

# mic_permission_needed
source: Microphone permission needed to record
vi: Cần quyền truy cập microphone để ghi âm

# mic_permission_settings
source: Please grant microphone permission in Settings
vi: Vui lòng cấp quyền microphone trong Settings

# start_recording_error
source: Error starting recording
vi: Lỗi khi bắt đầu ghi âm

# stop_recording_error
source: Error stopping recording
vi: Lỗi khi dừng ghi âm

# replying_to_status
source: Replying to {name}
vi: Đang trả lời {name}

# create_post_success
source: Post created successfully!
vi: Bài viết đã được tạo thành công!

# create_post_failed
source: Post creation failed!
vi: Bài viết tạo thất bại!

# posting_placeholder
source: Posting in progress...
vi: Đang đăng bài viết...

# post_deleted_message
source: Post has been deleted
vi: Bài viết đã được xóa

# error_loading_posts
source: Error loading posts: {error}
vi: Lỗi tải bài viết: {error}

# save_action
source: Save
vi: Lưu

# post_action
source: Post
vi: Đăng

# post_hint
source: What's on your mind?
vi: Bạn đang nghĩ gì?

# select_image_error
source: Error selecting image
vi: Lỗi khi chọn ảnh

# select_video_error
source: Error selecting video
vi: Lỗi khi chọn video

# enter_post_content_error
source: Please enter post content
vi: Vui lòng nhập nội dung bài viết

# post_updated_message
source: Post updated successfully!
vi: Bài viết đã được cập nhật!

# update_post_error
source: Error updating post
vi: Lỗi khi cập nhật bài viết

# create_post_error
source: Error creating post
vi: Lỗi khi tạo bài viết
