Repository: NghiaLio/Zipo-App
Catalog: lib/l10n/app_*.arb
Languages: vi

# confirm_delete_title
source: Confirm delete
vi: Xác nhận xóa

# confirm_delete_post_message
source: Are you sure you want to delete this post?
vi: Bạn có chắc chắn muốn xóa bài viết này không?

source: Comments ({count})
vi: Bình luận ({count})

# replying_to_comment
source: Replying to {name}
vi: Đang phản hồi {name}

# upload_media_failed
source: Media upload failed. Please try again.
vi: Tải lên media thất bại. Vui lòng thử lại.

# select_media_error
source: Could not select media. Please try again.
vi: Không thể chọn media. Vui lòng thử lại.

# delete_comment_action
source: Delete comment
vi: Xóa bình luận

# comment_hint
source: Write a comment...
vi: Viết bình luận...

# fail_loading_comments
source: Could not load comments. Please try again.
vi: Không thể tải bình luận. Vui lòng thử lại.

# error_label
source: Error
vi: Lỗi

# friends_title
source: Friends
vi: Bạn bè

# friend_requests_tab
source: Friend requests
vi: Lời mời kết bạn

# no_friends_message
source: No friends yet
vi: Chưa có bạn bè nào

# no_results_message
source: No results found
vi: Không tìm thấy kết quả

# no_friend_requests_message
source: No friend requests yet
vi: Chưa có lời mời kết bạn nào

# accept_action
source: Accept
vi: Xác nhận

# reject_action
source: Reject
vi: Từ chối

# about_title
source: About
vi: Giới thiệu

# version_label
source: Version {version}
vi: Phiên bản {version}

# main_features_section
source: Main Features
vi: Tính năng chính

# realtime_messaging_title
source: Real-time Messaging
vi: Nhắn tin thời gian thực

# realtime_messaging_desc
source: Send and receive messages instantly with friends
vi: Gửi và nhận tin nhắn tức thì với bạn bè

# notification_label
source: Notification
vi: Thông báo

# start_chat_invitation
source: Let's start the conversation!
vi: Hãy bắt đầu cuộc trò chuyện!

# error_occurred_message
source: An error occurred
vi: Đã xảy ra lỗi

# friend_request_fail
source: Failed to send friend request
vi: Gửi lời mời kết bạn thất bại

# revoke_action
source: Revoke
vi: Thu hồi

# download_success_message
source: Downloaded: {fileName}
vi: Đã tải xuống: {fileName}

# download_error_message
source: Error downloading: {error}
vi: Lỗi khi tải xuống: {error}

source: Could not load video
vi: Không thể tải video

# just_now_label
source: Just now
vi: Vừa xong
